Revit 2027 API
CompoundStructureLayer Properties
The CompoundStructureLayer type exposes the following members.
Properties
Name | Description
DeckEmbeddingType |  Embedding type for structural deck - only for a layer whose function is StructuralDeck.
DeckProfileId |  The ElementId of the structural deck profile - only for a layer whose function is StructuralDeck.
Function |  The function of the layer.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
LayerCapFlag |  Identifies if the layer participates in wrapping at end caps and/or inserts.
LayerId |  The id of the layer - note that this may be different from the index in the array of layers in a CompoundStructure.
LayerPriority |  The priority of the layer.
MaterialId |  Id of the material assigned to this layer.
Width |  Width of the layer.
Top
See Also
Reference
CompoundStructureLayer Class
Autodesk.Revit.DB Namespace